# ================================
#  Задание 1
# ================================
# Вычисли суммы чисел в диапазоне 
# Описание: Напиши программу, которая запрашивает у пользователя начальное и конечное значения диапазона чисел,
# а затем вычисляет сумму всех чисел в этом диапазоне.
### hints
# Запроси у пользователя начальное и конечное значения диапазона с помощью функции input().
# Преобразуй полученные значения из строкового типа в целочисленный с помощью функции int().
# Используй цикл for для итерации по всем числам в заданном диапазоне.
# Используй range() для получения диапазона чисел - в циксле (будет после in)
# Пример for num in range(с каколго числа, по какое)
# не забудь прибавить + 1 к конечному числу в range
# создай переменную к которой каждый раз будешь придалвять число - следующее в итерации 
# В каждой итерации цикла добавляй текущее число к переменной, которая хранит сумму всех чисел.
# Выведите полученную сумму на экран.

# ================================
#  Задание 2
# ================================
# С помощью цикла while создай программу, которая будет запрашивать у прользователя имя
# а затем будет выводить его в терминал
# Создай команду для выхода из цикла - 
# если пользователь введет - "q" то цикл завершиться
### hints 
# для выхода из цикла можно использовать сравненние != (не равен)
# создай переменную user_name - с типом None
# сделай условие в цикле проверяя != (команда для выхода)
